# shell

brew "zsh"

# utilities

# project specific commands
brew "just"
# perodic command output update
brew "watch"
# local env variables export
brew "direnv"
# man pages on macOS
brew "groff"
# use trash bin
brew "trash"
# app launcher
cask "alfred"
# window management
cask "rectangle"
# search
# brew "the_silver_searcher"
# commands
# brew "thefuck"
# search
brew "fzf"
brew "fd"
brew "ripgrep"

# editors

brew "neovim"
# brew "helix"
# cask "visual-studio-code"
# cask "vscodium"
# powerline fonts
cask "font-hack-nerd-font"
cask "font-monaspace-nerd-font"

# tools

# version control
brew "git"
brew "withgraphite/tap/graphite"
# shell prompt
brew "starship"
# terminals
cask "iterm2"
# cask "warp"
# brew "tmux"
brew "zellij"
# notes
# cask "notion"

# node

# asdf is used to manage node versions
brew "asdf"
# yarn is used to manage node packages
brew "yarn"

# python

# pyenv is used to set a specific python version
brew "pyenv"
# pyenv-virtualenv is used to create python virtual environments
brew "pyenv-virtualenv"
# isolated package runner
brew "pipx"

# remote

# aws access
# brew "awscli"
# configure k8 cluster access
# brew "kubectl"

# local dev

# database
# brew "postgresql"
# containers
# brew "docker"
# redis
# cask "redisinsight"

# other

# work
# cask "slack"
# browsers
# cask "google-chrome"

# fun
brew "cmatrix"
